README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org51fc42f)
2.  [Resumo e/ou informação extra:](#org53a10a7)
3.  [Versão:](#orgaea818e)
4.  [Data:](#org8c25ebb)
5.  [Autor de Contato:](#org8da498b)
6.  [Lista dos Autores:](#org9e06ae6)
7.  [Áreas de pesquisa vinculadas:](#orgd19bb70)
8.  [Vinculo com:](#org4956727)
9.  [Paradigmas:](#org611a033)
10. [Tipo de Interface:](#orgcd5616f)
11. [Plataformas Suportadas:](#org7046951)
12. [Linguagens Utilizadas:](#orga22601d)
13. [Bibliotecas Utilizadas (dependências):](#org96f7866)
14. [Softwares utilizados (dependências)](#org9b8156f)
15. [Tipo de Licença:](#org0f06f31)
16. [Links:](#org83d8dde)


<a id="org51fc42f"></a>

# Nome do Software (ou Biblioteca):

-   SIMULADOR DE PROPRIEDADES TERMODINÂMICAS DE SUBSTÂNCIAS

PURAS A PARTIR DE DENSIDADE E TEMPERATURA


<a id="org53a10a7"></a>

# Resumo e/ou informação extra:

-   A correta previsão das propriedades termodinâmicas e cálculo do equilíbrio de fases constitui-se num

ponto fundamental do projeto de qualquer processo da industria química, como sistemas de refrigeração.
A exploração e produção de reservas naturais de hidrocarbonetos não foge a essa regra, com a dificuldade
adicional de tratar complexas misturas de hidrocarbonetos, muitas vezes não bem caracterizadas, além
da presença de compostos não orgânicos, como água e dióxido de carbono, empregados em técnicas para
aumentar o fator de recuperação das jazidas.
Na simulação numérica computacional, que usa o modelo composicional de reservatórios de hidro-
carbonetos, um dos conjuntos de equações utilizado para a solução é composto pelos coeficientes de
distribuição dos componentes entre as fases presentes no meio poroso. Em varios momentos da simulação
uma ou mais fases podem ser constituídas de compostos puros. Nesse caso, ao invés de utilizar equações
de estado, são utilizadas correlações para prever as propriedades termodinâmicas, bem como as suas
derivadas (necessárias para o cálculo do jacobiano do método de Newton).

Objetivo geral:
– Deselvolver um software que calcula as propriedades termodinâmicas de uma substância pura
a partir de equações experimentais.


<a id="orgaea818e"></a>

# Versão:

-   1.0.


<a id="org8c25ebb"></a>

# Data:

-   2014/2 - segundo semestre.


<a id="org8da498b"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org9e06ae6"></a>

# Lista dos Autores:

-   THÔMAS AUGUSTO STEMPKOWSKI MENEGAZZO
-   ADOLFO PUIME PIRES (TERMODINÂMICA)
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orgd19bb70"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia Reservatório
-   Engenharia Química
-   Termodinâmica


<a id="org4956727"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="org611a033"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="orgcd5616f"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="org7046951"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="orga22601d"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org96f7866"></a>

# Bibliotecas Utilizadas (dependências):

-   QT


<a id="org9b8156f"></a>

# Softwares utilizados (dependências)

-   QT


<a id="org0f06f31"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org83d8dde"></a>

# Links:

